Repository: LibraryAsdmin/JLLKirjasto
Catalog: Properties/Resources.*.resx
Languages: fi_fi, sv_se

# AdminControlsWindowTitle
source: Database control panel
fi_fi: Tietokantojen hallintapaneeli
sv_se: Databas kontrollpanel

# bookAvailable
source: Available for borrowing
fi_fi: Saatavilla
sv_se: Tillgänglig

# BookDbAddButtonContent
source: Add book
fi_fi: Lisää teos tietokantaan
sv_se: Lägga till boken

# BookDbAdvancedSearchContent
source: Search options
fi_fi: Hakuasetukset
sv_se: Sök alternativ

# BookDbDelButtonContent
source: Delete book
fi_fi: Poista teos tietokannasta
sv_se: Radera boken

# BookDbEditButtonContent
source: Edit book
fi_fi: Muokkaa teosta
sv_se: Editera boken

# BookDbSearchButtonContent
source: Search
fi_fi: Hae
sv_se: Sök

# BookDbSearchOptionAmount
source: Total number
sv_se: Totalantal

# BookDbSearchOptionAuthor
source: Author
fi_fi: Kirjailija
sv_se: Författare

# BookDbSearchOptionAvailable
source: Availability
fi_fi: Saatavuus
sv_se: Tillgänglig

# BookDbSearchOptionCategory
source: Category
fi_fi: Aineistolaji
sv_se: Kategori

# BookDbSearchOptionLanguage
source: Language
fi_fi: Kieli
sv_se: Språk

# BookDbSearchOptionTitle
source: Title
fi_fi: Nimi
sv_se: Namn

# BookDbSearchOptionYear
source: Year
fi_fi: Julkaisuvuosi
sv_se: Utgivningsår

# BookDbWindowTitle
source: Book database administration
fi_fi: Kirjatietokannan hallinta
sv_se: Bokdatabas administration

# BookEditIDConflict
source: Warning! The book database already contains a book with the ID: {0}. Please make sure that the ID is unique.
sv_se: Varning! Bokdatabasen innehåller redan en bok med ID {0}. Se till at bokens ID inte finns i databasen.

# BookEditIDError
source: Error: The ID {0} is badly formatted. Make sure the ID contains only numbers and is 6 digits long.
fi_fi: Huomio! Kirjatietokanta sisältää jo teoksen jonka tunniste ID on {0}. Varmista että kirjoittamasi ID ei vastaa jo tietokannassa olevia.
sv_se: Fel! ID {0} har ett felaktigt format. Se till att ID innehåller bara nummer och är 6 tecken lång.

# BookEditWindowAcceptButtonContent
source: Accept
fi_fi: Hyväksy
sv_se: Acceptera

# BookEditWindowDeclineButtonContent
source: Decline
fi_fi: Peruuta
sv_se: Avböj

# BookEditWindowTitle
source: Edit book information
fi_fi: Muokkaa teosta
sv_se: Editera bok information

# bookNotAvailable
source: Borrowed by someone
fi_fi: Lainassa
sv_se: Lånad

# booksAvailable
source: {0}/{1} books available
sv_se: {0} / {1} böcker är tillgängliga

# BooksTabHeader
source: Books
fi_fi: Kirjat
sv_se: Böcker

source: Cancel
fi_fi: Peruuta
sv_se: Annullera

# confirmReturnAll
source: Are you sure you want to return all of your loans?
sv_se: Är dut säker på att du vill lämna in alla dina lånade böcker?

# confirmReturnAllTitle
source: Confirm returning all loans
sv_se: Acceptera inlämning

# DefaultLoginButtonContent
source: Log In
fi_fi: Kirjaudu
sv_se: Logga in

# DefaultLoginUsernameBoxContent
source: Wilma username
fi_fi: Wilma-tunnus
sv_se: Wilma-användarnamn

# DefaultSearchBoxContent
source: Search
fi_fi: Hae!
sv_se: Sök

# DefaultSignUpUsernameBoxContent
source: Type your wilma account here
fi_fi: Kirjoita tähän Wilma-tunnuksesi
sv_se: Skriv ner ditt Wilma-användarnamn

# DeleteBookConfirmationDialogContent
source: Are you sure you want to delete the selected book?
sv_se: Är du säker på att du bill radera den valda boken?

# DeleteBookConfirmationDialogTitle
source: Delete Book Confirmation
sv_se: Accepterande

# DeleteUserConfirmationDialogContent
source: Are you sure you want to delete the selected user?
sv_se: Är du säker på att du vill ta bort den valda användaren?

# DeleteUserConfirmationDialogTitle
source: Delete User Confirmation
sv_se: Accepterande

# DisplaySearchBookAuthor
source: Author
fi_fi: Kirjailija
sv_se: Författare

# DisplaySearchBookAvailability
source: Availability
fi_fi: Saatavuus
sv_se: Tillgänglig

# DisplaySearchBookCategory
source: Category
fi_fi: Aineistolaji
sv_se: Kategori

# DisplaySearchBookTitle
source: Title
fi_fi: Teoksen Nimi
sv_se: Titel

# DisplaySearchBookYear
source: Year of Publication
fi_fi: Julkaisuvuosi
sv_se: Utgivningsår

# Greeting
source: Greetings!
fi_fi: Päivää!
sv_se: Hejsan!

# HomeButtonContent
source: Go Home
fi_fi: Alkusivu
sv_se: Hemsida

# HomeLoginButtonInstruction
source: to borrow books
fi_fi: lainataksesi kirjoja
sv_se: att låna böcker

# HomeLoginButtonTitle
source: Log In
fi_fi: Kirjaudu sisään
sv_se: Logga in

# HomeSearchButtonInstruction
source: for books and authors
fi_fi: teoksia ja kirjailijoita
sv_se: verk och författare

# HomeSearchButtonTitle
source: Search
fi_fi: Hae
sv_se: Sök

# HomeSignUpButtonInstruction
source: in order to use the llibrary
fi_fi: käyttääksesi kirjastoa
sv_se: för att använda biblioteket

# HomeSignUpButtonTitle
source: Sign Up
fi_fi: Rekisteröidy
sv_se: Bli medlem

# loggedInUserGreeting
source: Greetings, {0}!
fi_fi: Tervehdys, {0}!
sv_se: Hälsningar, {0}!

# loggedInUserInstruction
source: You can borrow more books from the book search, or return your books by selecting them in the list on the left and pressing the button.
fi_fi: Voit lainata kirjoja hausta tai palauttaa niitä valitsemalla ne listasta ja painamalla oikeasta nappulasta.
sv_se: Du kan låna flera böcker från boksökningen och lämna in dina böcker genom att välja dem från listan på vänster sida och klicka på knappen.

# LogOutButtonContent
source: Log out
sv_se: Logga ut

source: No
fi_fi: Ei
sv_se: Nej

# QuickReturnButtonContent
source: Quick Return
fi_fi: Pikapalautus
sv_se: Snabb retur

# QuickReturnInstruction
source: Please type the ID of the book
fi_fi: Kirjoita kirjan ID
sv_se: Vänligen skriv bokens ID

# ReturnAllButtonContent
source: Return all your books
sv_se: Lämna in alla dina böcker

# ReturnButtonContent
source: Return
fi_fi: Palauta
sv_se: Lämna in

# ReturnSelectedButtonContent
source: Return the selected book
sv_se: Lämna in den valda boken

# SignUpButtonContent
source: Sign Up
fi_fi: Rekisteröidy
sv_se: Bli medlem

# SignUpConfirmationButtonContent
source: Confirm
fi_fi: Luo tunnus
sv_se: Acceptera

# SignUpEmailTitle
source: Verification Code
fi_fi: Varmennuskoodi
sv_se: Verifieringskod

# SignUpErrorMessage
source: Whoops! Something went wrong while creating a new user account. Please make sure that you typed correctly.
fi_fi: Hupsista! Jotakin meni vikaan ohjelman luodessa uutta tunnusta. Varmista, että kirjoitit tunnuksesi oikein.
sv_se: Hoppsan! Något gick fel medan du skapade ett nytt användarnamn. Vänligen se till att du har skrivit rätt.

# SignUpInstruction1
source: Create an account by typing your Wilma email to the text box below.
fi_fi: Luo tunnus kirjoittamalla Wilma sähköpostiosoitteesi alla olevaan laatikkoon.
sv_se: Skapa ett användarnamn genom att skriva ditt Wilma-användarnamn.

# SignUpInstruction2
source: An email containing a confirmation code was sent to the email address associated with your Wilma account. The link to the login page is provided below. Type the code to the text box below to finish the account creation process.
fi_fi: Wilmatunnukseesi kuuluvaan sähköpostiosoitteeseen lähetettiin varmennuskoodi. Löydät linkin kirjautumissivulle alta. Kirjoita koodi alla olevaan laatikkoon valmistaaksesi käyttäjän luonnin.
sv_se: Ett mejl som innehåller en verifieringskod skickades till e-post associerad med ditt Wilma-användarnamn. Länken till Logga in –sidan finns nedan. Skriv koden till textlådan nedan för att avsluta att skapa ett användarnamn.

# SignUpWrongCode
source: The entered code was incorrect. Account creation unsuccessful!
fi_fi: Syöttämäsi koodi oli virheellinen. Käyttäjän luonti epäonnistui.
sv_se: Den inmatade koden var felaktig. Att skapa ett användarnamn gick fel.

# UserAddWilmaError
source: Error: The Wilma address {0} does not seem valid. Make sure that the Wilma address does not contain typing errors.
sv_se: Fel! Wilma-användarnamnet {0} verkar vara felaktigt. Se till att Wilma-användarnamnet inte innehåller skrivfel.

# UserAddWindowTitle
source: Add user to the database
sv_se: Tillägg användaren till databasen.

# UserDbAddButtonContent
source: Add user
fi_fi: Lisää käyttäjä
sv_se: Tillägg användaren

# UserDbDelButtonContent
source: Delete user
fi_fi: Poista käyttäjä
sv_se: Radera användaren

# UserDbEditButtonContent
source: Edit user
fi_fi: Muokkaa käyttäjää
sv_se: Editera användaren

# UserDbSearchOptionLoans
source: Loans
fi_fi: Lainat
sv_se: Lån

# UserDbSearchOptionWilma
source: Username
fi_fi: Käyttäjätunnus
sv_se: Användarnamn

# UserDbWindowTitle
source: User database administration
fi_fi: Käyttäjätietokannan hallinta
sv_se: Användardatabasens administration

# UserEditWilmaError
source: Warning! The user database already contains an user with the Wilma address: {0}. Please make sure that the Wilma address is unique.
fi_fi: Huomio! Käyttäjätietokanta sisältää jo käyttäjän, jolla on sama Wilma osoite: {0}. Varmista että Wilma osoite on ainutlaatuinen.
sv_se: Fel! Användardatabasen innehåller redan en användare med Wilma-användarnamnet: {0}. Vänligen se till att Wilma-användarnamnet inte finns i databasen.

# UserEditWindowTitle
source: Edit user information
fi_fi: Muuta käytäjän tietoja
sv_se: Editera användarinformation.

# UsersTabHeader
source: Users
fi_fi: Käyttäjät
sv_se: Användare

# WindowTitle
source: The Library of Joensuun lyseon lukio
fi_fi: Joensuun lyseon lukion kirjasto
sv_se: Joensuun lyseon lukios bibliotek

source: Yes
fi_fi: Kyllä
sv_se: Ja

# TextUnderAccountCreation
source: Here's the text under accout creation button.
fi_fi: Tässä teksti tunnuksenluontinappulan alla.

# TextUnderLogin
source: Here's the text under login button.
fi_fi: Tässä teksti kirjautumisnappulan alla.

# TextUnderSearchBox
source: Search for books or authors by typing into the box above.
fi_fi: Hae kirjoja tai kirjailijoita kirjastosta kirjoittamalla yläpuolella olevaan laatikkoon.
